In [6]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame(np.random.randn(5,6),index='A B C D E'.split(),columns='Q W E R T Y'.split())

In [8]:
df

          Q         W         E         R         T         Y
A  0.134124  1.426067  0.541531 -1.323307 -0.528868  0.566311
B  2.936756  0.231581  0.987193 -0.111767  0.999995 -1.657371
C  0.461883 -0.172430 -0.116511 -1.170728  0.972224 -0.522022
D -0.235668 -0.635587  0.145804  1.316187 -0.137117 -0.711095
E  1.017009  1.584238  0.610376 -0.709675 -0.115121 -0.827291

In [9]:
#memanggil kolum W
df['W']

A    1.426067
B    0.231581
C   -0.172430
D   -0.635587
E    1.584238
Name: W, dtype: float64

In [10]:
df.W

A    1.426067
B    0.231581
C   -0.172430
D   -0.635587
E    1.584238
Name: W, dtype: float64

In [11]:
#memanggil n kolum
df[['W','R']]

          W         R
A  1.426067 -1.323307
B  0.231581 -0.111767
C -0.172430 -1.170728
D -0.635587  1.316187
E  1.584238 -0.709675

In [12]:
df[['Q']]

          Q
A  0.134124
B  2.936756
C  0.461883
D -0.235668
E  1.017009

In [13]:
#Menambah kolum baru
df['baru']=df['Q']+df['W']
df

          Q         W         E         R         T         Y      baru
A  0.134124  1.426067  0.541531 -1.323307 -0.528868  0.566311  1.560190
B  2.936756  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C  0.461883 -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.235668 -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.017009  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [14]:
np.sum(df)

Q       4.314103
W       2.433868
E       2.168393
R      -1.999291
T       1.191113
Y      -3.151468
baru    6.747971
dtype: float64

In [15]:
np.sum(df['Q'])

4.314103010577436

In [16]:
#Menghapus kolom
df.drop('W',axis=1)

          Q         E         R         T         Y      baru
A  0.134124  0.541531 -1.323307 -0.528868  0.566311  1.560190
B  2.936756  0.987193 -0.111767  0.999995 -1.657371  3.168337
C  0.461883 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.235668  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.017009  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [17]:
df

          Q         W         E         R         T         Y      baru
A  0.134124  1.426067  0.541531 -1.323307 -0.528868  0.566311  1.560190
B  2.936756  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C  0.461883 -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.235668 -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.017009  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [18]:
df.drop('Q',axis=1,inplace=True)

In [19]:
df.drop('A',axis=0)

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [20]:
df

          W         E         R         T         Y      baru
A  1.426067  0.541531 -1.323307 -0.528868  0.566311  1.560190
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [21]:
df.drop('A',axis=0,inplace=False)

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [22]:
df

          W         E         R         T         Y      baru
A  1.426067  0.541531 -1.323307 -0.528868  0.566311  1.560190
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [23]:
df.drop('A',axis=0,inplace=True)

In [24]:
df

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [25]:
df['E']

B    0.987193
C   -0.116511
D    0.145804
E    0.610376
Name: E, dtype: float64

In [26]:
df.loc['C']

W      -0.172430
E      -0.116511
R      -1.170728
T       0.972224
Y      -0.522022
baru    0.289453
Name: C, dtype: float64

In [27]:
df.iloc[2]

W      -0.635587
E       0.145804
R       1.316187
T      -0.137117
Y      -0.711095
baru   -0.871256
Name: D, dtype: float64

In [28]:
df.loc[['B','D','E']]

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [29]:
df.loc[['D'],['T']]

          T
D -0.137117

In [30]:
df.loc[['B','D'],['R','T']]

          R         T
B -0.111767  0.999995
D  1.316187 -0.137117

In [31]:
df>0

       W      E      R      T      Y   baru
B   True   True  False   True  False   True
C  False  False  False   True  False   True
D  False   True   True  False  False  False
E   True   True  False  False  False   True

In [32]:
df[df>0]

          W         E         R         T   Y      baru
B  0.231581  0.987193       NaN  0.999995 NaN  3.168337
C       NaN       NaN       NaN  0.972224 NaN  0.289453
D       NaN  0.145804  1.316187       NaN NaN       NaN
E  1.584238  0.610376       NaN       NaN NaN  2.601246

In [33]:
df[df['T']>0]

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453

In [34]:
df[df['T']>0]['Y']

B   -1.657371
C   -0.522022
Name: Y, dtype: float64

In [35]:
df[(df['R']>1) & (df['T']>0)]

Empty DataFrame
Columns: [W, E, R, T, Y, baru]
Index: []

In [36]:
df

          W         E         R         T         Y      baru
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [37]:
df[(df['R']>0) & (df['Y']>0)]

Empty DataFrame
Columns: [W, E, R, T, Y, baru]
Index: []

In [38]:
#menghapusIndex
df.reset_index()

  index         W         E         R         T         Y      baru
0     B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
1     C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
2     D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
3     E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [39]:
#Menambah kolum
df['kode']='INA IND RUS JPN'.split()

In [40]:
df

          W         E         R         T         Y      baru kode
B  0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337  INA
C -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453  IND
D -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256  RUS
E  1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246  JPN

In [41]:
df.set_index('kode')

             W         E         R         T         Y      baru
kode
INA   0.231581  0.987193 -0.111767  0.999995 -1.657371  3.168337
IND  -0.172430 -0.116511 -1.170728  0.972224 -0.522022  0.289453
RUS  -0.635587  0.145804  1.316187 -0.137117 -0.711095 -0.871256
JPN   1.584238  0.610376 -0.709675 -0.115121 -0.827291  2.601246

In [45]:
#membuat tabel multi index
datalabels = ['G1','G1','G1','G2','G2','G2'] #data array
datavalue = [1,2,3,1,2,3]
data = list(zip(datalabels,datavalue))

data = pd.MultiIndex.from_tuples(data)

In [46]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
tabelmulti = pd.DataFrame(np.random.randn(6,2),index=data,columns='A B'.split())

In [49]:
tabelmulti

             A         B
G1 1 -0.290223 -0.920800
   2 -0.886485 -0.619581
   3 -0.358852 -0.122265
G2 1 -0.538899 -0.641307
   2 -1.268700  0.487142
   3  0.499745  0.776857

In [50]:
tabelmulti.index.names

FrozenList([None, None])

In [52]:
tabelmulti.index.names='Grup No'.split()

In [53]:
tabelmulti

                A         B
Grup No
G1   1  -0.290223 -0.920800
     2  -0.886485 -0.619581
     3  -0.358852 -0.122265
G2   1  -0.538899 -0.641307
     2  -1.268700  0.487142
     3   0.499745  0.776857

In [54]:
#memanggil data berindex G1
tabelmulti.loc['G1']

           A         B
No
1  -0.290223 -0.920800
2  -0.886485 -0.619581
3  -0.358852 -0.122265

In [55]:
tabelmulti.xs('G1')

           A         B
No
1  -0.290223 -0.920800
2  -0.886485 -0.619581
3  -0.358852 -0.122265

In [56]:
tabelmulti.loc['G1'].loc[2]

A   -0.886485
B   -0.619581
Name: 2, dtype: float64

In [57]:
tabelmulti.xs(['G2',1])

A   -0.538899
B   -0.641307
Name: (G2, 1), dtype: float64

In [59]:
#memanggil nomor 3 di semua grup
tabelmulti.xs(3,level='No')

             A         B
Grup
G1   -0.358852 -0.122265
G2    0.499745  0.776857